/**********************************************************************
   File    task_1_answer.cpp
   Author  umeda hiroki (22w)
   Environment    ROS_noetic
   OS       Ubuntu 20.04
   StartDay 2023/04/
**********************************************************************/


/**********************************************************************
   Include Libraries
**********************************************************************/
#include <opencv2/opencv.hpp>
#include <opencv2/imgproc.hpp>
#include <opencv2/core/core.hpp>
#include <opencv2/highgui/highgui.hpp>
#include <iostream>


/**********************************************************************
   Declare variables
**********************************************************************/


/**********************************************************************
   Globle
**********************************************************************/



/**********************************************************************
   Proto_type_Declare functions
**********************************************************************/



/**********************************************************************
   Main
**********************************************************************/
int main(int argc, char** argv){

  std::cout << "ok" << std::endl;
  /* imageというcv::Mat型の変数を作る */


  /* sample.pngを読み込む(pathは各自の環境に合わせてください) */


  /* 生データを表示してみよう */


  /* グレースケール変換をしてみよう */


  /* 二値化をしてみよう */


  /* エッジ検出をしてみよう */


  /* 画像の大きさを取得してみよう(行と列) */


  /* ちょっと応用　hsv変換をしてから緑色抽出*/


  cv::waitKey(0);
  return 0;
}
